deep-learning/ml.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-06-08 Wed 10:42 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>ml</title>
<meta name="author" content="arius" />
<meta name="generator" content="Org Mode" />
<link rel="shortcut icon" href="favicon.ico" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">ml</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org5934399">1. Refers</a></li>
<li><a href="#orgb28b68e">2. nlp</a></li>
<li><a href="#org9d590d3">3. Intro</a>
<ul>
<li><a href="#org0405fe2">3.1. Simple overview</a></li>
</ul>
</li>
<li><a href="#orga5bf522">4. Type</a>
<ul>
<li><a href="#org0d1f176">4.1. Regression</a></li>
<li><a href="#org93a6160">4.2. Classification</a></li>
<li><a href="#org240f606">4.3. Structure learning</a></li>
</ul>
</li>
<li><a href="#orgb4329d6">5. Concept</a>
<ul>
<li><a href="#org457cfa3">5.1. Model</a></li>
<li><a href="#org329548d">5.2. Feature</a></li>
<li><a href="#org0c9c62f">5.3. Unknown parameters</a>
<ul>
<li><a href="#orgd612295">5.3.1. weight</a></li>
<li><a href="#org3314ebe">5.3.2. bias</a></li>
</ul>
</li>
<li><a href="#org406380d">5.4. Loss</a></li>
<li><a href="#org52b8dee">5.5. Label</a></li>
<li><a href="#org837902c">5.6. Error Surface</a></li>
<li><a href="#orgb65bf59">5.7. Hyperparamters</a></li>
<li><a href="#orgef63ea4">5.8. Optimization</a>
<ul>
<li><a href="#orge9d9dc3">5.8.1. Gradient Descent 梯度下降法</a></li>
<li><a href="#orgc28ae9c">5.8.2. Domain knowledge</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org5934399" class="outline-2">
<h2 id="org5934399"><span class="section-number-2">1.</span> Refers</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><a href="https://github.com/microsoft/ML-For-Beginners">https://github.com/microsoft/ML-For-Beginners</a></li>
<li><a href="https://github.com/purocean/tensorflow-simple-captcha">https://github.com/purocean/tensorflow-simple-captcha</a></li>
<li><a href="https://github.com/datawhalechina/pumpkin-book">https://github.com/datawhalechina/pumpkin-book</a></li>
<li><a href="https://github.com/abhisheksoni27/machine-learning-with-js">https://github.com/abhisheksoni27/machine-learning-with-js</a></li>
<li><a href="https://github.com/axetroy/ml-KNN-flower">https://github.com/axetroy/ml-KNN-flower</a></li>
<li><a href="https://github.com/nndl/exercise">https://github.com/nndl/exercise</a></li>
<li><a href="https://github.com/dragen1860/Deep-Learning-with-TensorFlow-book">https://github.com/dragen1860/Deep-Learning-with-TensorFlow-book</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgb28b68e" class="outline-2">
<h2 id="orgb28b68e"><span class="section-number-2">2.</span> nlp</h2>
<div class="outline-text-2" id="text-2">
<p>
<a href="https://github.com/fighting41love/funNLP">https://github.com/fighting41love/funNLP</a>
</p>
</div>
</div>
<div id="outline-container-org9d590d3" class="outline-2">
<h2 id="org9d590d3"><span class="section-number-2">3.</span> Intro</h2>
<div class="outline-text-2" id="text-3">
<p>
Let machine create a function work for our result.
</p>
</div>
<div id="outline-container-org0405fe2" class="outline-3">
<h3 id="org0405fe2"><span class="section-number-3">3.1.</span> Simple overview</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Steps:
</p>
<ol class="org-ol">
<li>Create an unknown function</li>
<li>Define Loss from training data</li>
<li>Optimization to minima loss and get the function</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-orga5bf522" class="outline-2">
<h2 id="orga5bf522"><span class="section-number-2">4.</span> Type</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org0d1f176" class="outline-3">
<h3 id="org0d1f176"><span class="section-number-3">4.1.</span> Regression</h3>
</div>
<div id="outline-container-org93a6160" class="outline-3">
<h3 id="org93a6160"><span class="section-number-3">4.2.</span> Classification</h3>
</div>
<div id="outline-container-org240f606" class="outline-3">
<h3 id="org240f606"><span class="section-number-3">4.3.</span> Structure learning</h3>
<div class="outline-text-3" id="text-4-3">
<p>
Create something
</p>
</div>
</div>
</div>
<div id="outline-container-orgb4329d6" class="outline-2">
<h2 id="orgb4329d6"><span class="section-number-2">5.</span> Concept</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org457cfa3" class="outline-3">
<h3 id="org457cfa3"><span class="section-number-3">5.1.</span> Model</h3>
<div class="outline-text-3" id="text-5-1">
<p>
Unknown parameters function.
</p>
</div>
</div>
<div id="outline-container-org329548d" class="outline-3">
<h3 id="org329548d"><span class="section-number-3">5.2.</span> Feature</h3>
<div class="outline-text-3" id="text-5-2">
<p>
Real variable may bring effect to result.
</p>
</div>
</div>
<div id="outline-container-org0c9c62f" class="outline-3">
<h3 id="org0c9c62f"><span class="section-number-3">5.3.</span> Unknown parameters</h3>
<div class="outline-text-3" id="text-5-3">
</div>
<div id="outline-container-orgd612295" class="outline-4">
<h4 id="orgd612295"><span class="section-number-4">5.3.1.</span> weight</h4>
</div>
<div id="outline-container-org3314ebe" class="outline-4">
<h4 id="org3314ebe"><span class="section-number-4">5.3.2.</span> bias</h4>
<div class="outline-text-4" id="text-5-3-2">
<p>
Amend result base on weight and feature.
</p>
</div>
</div>
</div>
<div id="outline-container-org406380d" class="outline-3">
<h3 id="org406380d"><span class="section-number-3">5.4.</span> Loss</h3>
<div class="outline-text-3" id="text-5-4">
<p>
Function: \(L(b,w)\)
</p>

<p>
Define the how good of the parameters set.
</p>

<p>
Value based on the training data, type
</p>
<ul class="org-ul">
<li>MAE. mean absolute error</li>
<li>MSE, mean square error</li>
</ul>

<p>
Example:
</p>

<p>
\(L = \frac{ 1 }{ N }\sum_{n} e_n\)
</p>
</div>
</div>

<div id="outline-container-org52b8dee" class="outline-3">
<h3 id="org52b8dee"><span class="section-number-3">5.5.</span> Label</h3>
<div class="outline-text-3" id="text-5-5">
<p>
The correct value from training data.
</p>
</div>
</div>

<div id="outline-container-org837902c" class="outline-3">
<h3 id="org837902c"><span class="section-number-3">5.6.</span> Error Surface</h3>
<div class="outline-text-3" id="text-5-6">
<p>
Chart of Loss base on different parameters a
</p>
</div>
</div>

<div id="outline-container-orgb65bf59" class="outline-3">
<h3 id="orgb65bf59"><span class="section-number-3">5.7.</span> Hyperparamters</h3>
<div class="outline-text-3" id="text-5-7">
<p>
Manual value
</p>
</div>
</div>

<div id="outline-container-orgef63ea4" class="outline-3">
<h3 id="orgef63ea4"><span class="section-number-3">5.8.</span> Optimization</h3>
<div class="outline-text-3" id="text-5-8">
<p>
Process to caculate a set of parameters let L as min as possible
</p>
</div>

<div id="outline-container-orge9d9dc3" class="outline-4">
<h4 id="orge9d9dc3"><span class="section-number-4">5.8.1.</span> Gradient Descent 梯度下降法</h4>
<div class="outline-text-4" id="text-5-8-1">
<p>
Steps:
</p>
<ol class="org-ol">
<li>Random pick a initial value for weight</li>
<li>Compute differential \(\frac{\partial L}{\partial w}|_{w=w^o}\)
<ol class="org-ol">
<li>Negative, increase w, step size bese on differential</li>
<li>Positive, decrease w</li>
<li>Learning rate \(\eta\) (hyperparamters) \(\eta\frac{\partial L}{\partial W}|_{w=w^o}\)</li>
</ol></li>
</ol>

<p>
\(w^1 \leftarrow w^0 - \eta\frac{ \partial L }{ \partial W}|_{w=w^o}\)
</p>

<ol class="org-ol">
<li>Get next \(w^{n+1}\) and iterative update
<ol class="org-ol">
<li>Base on patience (Hyperparameter)</li>
<li>Find a parameter set with minima \(L\), differential as 0</li>
</ol></li>
</ol>

<p>
Disadvantage:
</p>
<ul class="org-ul">
<li>Local minima, Global minima, which is not the key point.</li>
</ul>

<p>
PS:
</p>
<ul class="org-ul">
<li>Differential always has been set up and can be done in one line with most deep learning frameworks.</li>
</ul>
</div>
</div>

<div id="outline-container-orgc28ae9c" class="outline-4">
<h4 id="orgc28ae9c"><span class="section-number-4">5.8.2.</span> Domain knowledge</h4>
<div class="outline-text-4" id="text-5-8-2">
<p>
Change features base on domain knowledge
</p>
</div>

<ol class="org-ol">
<li><a id="org594a320"></a>Linear model<br /></li>
</ol>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2021-11-26 Fri 10:55</p>
<p class="author">Author: arius</p>
<p class="date">Created: 2022-06-08 Wed 10:42</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
